## Transform index and columns

In [1]:
import pandas as pd

multicol1 = pd.MultiIndex.from_tuples([('weight', 'kg'), ('weight', 'pounds')])
df_multi_level_cols1 = pd.DataFrame([[1, 2], [2, 4]],
                                    index=['cat', 'dog'],
                                    columns=multicol1)
df_multi_level_cols1

    weight
        kg pounds
cat      1      2
dog      2      4

In [2]:
# Transfer columns to index
df_multi_level_cols1.stack()

            weight
cat kg           1
    pounds       2
dog kg           2
    pounds       4

In [3]:
df_multi_level_cols1.stack().index

MultiIndex([('cat',     'kg'),
            ('cat', 'pounds'),
            ('dog',     'kg'),
            ('dog', 'pounds')],
           )

In [4]:
# Transfer index to columns
df_multi_level_cols1.stack().unstack()

    weight
        kg pounds
cat      1      2
dog      2      4

In [5]:
df_multi_level_cols1.stack().unstack().index

Index(['cat', 'dog'], dtype='object')

## Transfer the column names to data value

In [6]:
df = pd.DataFrame({'Name':{0:'Jiao', 1:'John', 2:'Shiela'}, 
                   'course':{0:'python', 1:'ML', 2:'DM'}, 
                   'Age':{0:22, 1:15, 2:50}})
df

     Name  course  Age
0    Jiao  python   22
1    John      ML   15
2  Shiela      DM   50

In [7]:
# Transfer all columns
df.melt()

  variable   value
0     Name    Jiao
1     Name    John
2     Name  Shiela
3   course  python
4   course      ML
5   course      DM
6      Age      22
7      Age      15
8      Age      50

In [9]:
# Transfer certain columns
df.melt(id_vars='Name')

     Name variable   value
0    Jiao   course  python
1    John   course      ML
2  Shiela   course      DM
3    Jiao      Age      22
4    John      Age      15
5  Shiela      Age      50

In [10]:
# Transfer certain columns
df.melt(value_vars='Name')

  variable   value
0     Name    Jiao
1     Name    John
2     Name  Shiela

## Reorganize data

In [11]:
df = pd.DataFrame({'fff': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bbb': ['P', 'Q', 'R', 'P', 'Q', 'R'],
                   'baa': [2, 3, 4, 5, 6, 7],
                   'zzz': ['h', 'i', 'j', 'k', 'l', 'm']})
df

   fff bbb  baa zzz
0  one   P    2   h
1  one   Q    3   i
2  one   R    4   j
3  two   P    5   k
4  two   Q    6   l
5  two   R    7   m

In [17]:
df.pivot(index='fff', columns='bbb', values=['baa', 'zzz'])

    baa       zzz
bbb   P  Q  R   P  Q  R
fff
one   2  3  4   h  i  j
two   5  6  7   k  l  m